//==================================================
//變數,陣列宣告技巧
//命名技巧
//==================================================

var num,
	tmp = 123,
	tmp2 = 'Andrew',
	str;


//==================================================
//多變數宣告時, 分開宣告
//如果變數設定為字串, 宣告時直接宣告字串, 整數先宣告0
//宣告時, 在 "=" 左右留空白
//字串宣告時, 使用單引號'', 比使用雙引號""好
//==================================================

var num = 0;
var tmp = 123;
var tmp2 = 'Andrew';
var str = '';


//==================================================
//宣告時盡可能地分割, 或是表明變數的意義
//盡可能的不要再變數宣告時使用 num1, num2 這種宣告方式 
//==================================================

//使用者的姓名與年齡
var age = 0;
var name = '';
//學校資訊
var id = 12;
var school = 'oit';

//==================================================
//變數宣告前面, 除了用對名詞之外, 加上"擁有者"會更清楚
//也就是標明, 該變數真正代表的人或目標
//如果你覺得夠清楚, school可以簡寫成sch
//==================================================


//使用者的姓名與年齡
var userAge = 0;
var userName = '';
//學校資訊
var schId = 12;
var schName = 'oit';


//==================================================
//如果有類似num1, num2, num3 的資料形態, 應使用陣列
//當有逗號時, 在逗號後方留白程式碼較容易閱讀
//==================================================
var num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];


//==================================================
//正確的縮排與段行, 空白
//所有該加上分號; 的地方,皆"必須"加上分號
//==================================================

if (true) {
	for (var i = 0; i < 10; i++) {
		console.log('i=' + i.toString());
	}
}
